---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerItem.BarTypeId
source: html/e01fc1b7-7414-ee88-44b5-91ece090d12e.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.BarTypeId Property

The identifier of the rebar bar type.

## Syntax (C#)
```csharp
public ElementId BarTypeId { get; }
```